; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	spectrograph2 - mode
	infrared0 - mode
	thermograph1 - mode
	GroundStation3 - direction
	Star10 - direction
	Star1 - direction
	GroundStation6 - direction
	Star0 - direction
	Star4 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star10)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation9)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star1)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation9)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 Star0)
	(supports instrument11 spectrograph2)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star8)
	(calibration_target instrument11 GroundStation2)
	(calibration_target instrument11 GroundStation7)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
	(supports instrument12 spectrograph2)
	(supports instrument12 thermograph1)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation9)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 GroundStation2)
	(calibration_target instrument13 GroundStation7)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 Star5)
	(calibration_target instrument14 GroundStation2)
	(calibration_target instrument14 GroundStation7)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation9)
)
(:goal (and
	(pointing satellite3 Planet14)
	(pointing satellite4 Planet12)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Planet13 spectrograph2)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 spectrograph2)
))

)

; plan
1. (switch_on instrument12 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument12)
   goals met: 1 of 7
2. (calibrate satellite5 instrument12 groundstation9)
   added: (calibrated instrument12)
   goals met: 1 of 7
3. (turn_to satellite5 planet12 groundstation9)
   deleted: (pointing satellite5 groundstation9)
   added: (pointing satellite5 planet12)
   goals met: 1 of 7
4. (take_image satellite5 planet12 instrument12 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 2 of 7
5. (turn_to satellite5 phenomenon15 planet12)
   deleted: (pointing satellite5 planet12)
   added: (pointing satellite5 phenomenon15)
   goals met: 2 of 7
6. (take_image satellite5 phenomenon15 instrument12 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 3 of 7
7. (turn_to satellite5 phenomenon11 phenomenon15)
   deleted: (pointing satellite5 phenomenon15)
   added: (pointing satellite5 phenomenon11)
   goals met: 3 of 7
8. (take_image satellite5 phenomenon11 instrument12 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 7
9. (turn_to satellite3 planet14 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet14)
   goals met: 5 of 7
10. (turn_to satellite5 planet13 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet13)
   goals met: 5 of 7
11. (take_image satellite5 planet13 instrument12 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 6 of 7
12. (turn_to satellite5 planet14 planet13)
   deleted: (pointing satellite5 planet13)
   added: (pointing satellite5 planet14)
   goals met: 6 of 7
13. (take_image satellite5 planet14 instrument12 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 7 of 7
